In [1]:
"""


 <<< 5.0 Pandas >>>



"""

'\n\n\n <<< 5.0 Pandas >>>\n\n\n\n'

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2["d"] =6

In [12]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
"b" in obj2

True

In [17]:
"e" in obj2

False

In [18]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [19]:
obj3 = pd.Series(sdata)

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [22]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [23]:
obj4 = pd.Series(sdata, index=states)

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
obj4.name = "population"

In [33]:
obj4.index.name = "state"

In [34]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [36]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [37]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [38]:
"""


 <<< 5.1 DataFrame >>>



"""

'\n\n\n <<< 5.1 DataFrame >>>\n\n\n\n'

In [39]:
data ={"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
       "year": [2000, 2001, 2002, 2001, 2002, 2003],
       "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [40]:
frame = pd.DataFrame(data)

In [41]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [43]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [44]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [45]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [46]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [47]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [48]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [49]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [50]:
frame.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [51]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [52]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [53]:
frame2["debt"] = 16.5

In [54]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [55]:
frame2["debt"] = np.arange(6.)

In [56]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [57]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [58]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [59]:
frame2["debt"] = val

In [60]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [61]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [62]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [63]:
del frame2["eastern"]

In [64]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [65]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [66]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [67]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002:2.9}}

In [68]:
frame3 = pd.DataFrame(populations)

In [69]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [70]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [71]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [72]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}

In [73]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [74]:
frame3.index.name = "year"

In [75]:
frame3.columns.name = "state"

In [76]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [77]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [78]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [79]:
obj = pd.Series(np.arange(3), index=["a","b", "c"])

In [80]:
index = obj.index

In [81]:
index

Index(['a', 'b', 'c'], dtype='object')

In [82]:
index[1:]

Index(['b', 'c'], dtype='object')

In [83]:
labels = pd.Index(np.arange(3))

In [84]:
labels

Index([0, 1, 2], dtype='int64')

In [85]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [86]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [87]:
obj2.index is labels

True

In [88]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [89]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [90]:
"Ohio" in frame3.columns

True

In [91]:
2003 in frame3.index

False

In [92]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [93]:
"""


 <<< 5.2 Essential Functionality >>>



"""

'\n\n\n <<< 5.2 Essential Functionality >>>\n\n\n\n'

In [94]:
""" <<< 5.2.1: Reindexing >>> """

' <<< 5.2.1: Reindexing >>> '

In [95]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "a", "c"])

In [96]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [97]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [98]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [99]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [100]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [101]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [102]:
frame =  pd.DataFrame(np.arange(9).reshape((3,3)), 
                      index=["a", "b", "c"],
                      columns=["Ohio", "Texas", "California"])

In [103]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [104]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [105]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [106]:
states = ["Texas", "Utah", "California"]

In [107]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [108]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [109]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [110]:
frame.loc[["a", "b", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
b           5      4
c           8      7

In [111]:
"""


 <<< 5.2.2 Dropping Entries from and Axis >>>



"""

'\n\n\n <<< 5.2.2 Dropping Entries from and Axis >>>\n\n\n\n'

In [112]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [113]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [114]:
new_obj = obj.drop("c")

In [115]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [116]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [117]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [118]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
        index=["Ohio", "Colorado", "Utah", "New York"],
        columns=["one", "two", "three", "four"])

In [119]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [120]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [121]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [122]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [123]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [124]:
"""


 <<< 5.2.3 Indexing, Selection, and Filtering >>>



"""

'\n\n\n <<< 5.2.3 Indexing, Selection, and Filtering >>>\n\n\n\n'

In [125]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [126]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [127]:
obj["b"]

1.0

In [128]:
obj.iloc[1]

1.0

In [129]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [130]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [131]:
obj.iloc[[1,3]]

b    1.0
d    3.0
dtype: float64

In [132]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [133]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [134]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [135]:
obj2 = pd.Series([1, 2, 3], index = ["a", "b", "c"])

In [136]:
obj1

2    1
0    2
1    3
dtype: int64

In [137]:
obj2

a    1
b    2
c    3
dtype: int64

In [138]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [139]:
obj2[[0, 1, 2]]

/tmp/ipykernel_3771/2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [140]:
try:
    obj2.loc[[0, 1]] 
except KeyError:
    print("Nope. The index doesn't contain integers")

Nope. The index doesn't contain integers

In [141]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [142]:
obj2.iloc[[0, 1,  2]]

a    1
b    2
c    3
dtype: int64

In [143]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [144]:
obj2.loc["b":"c"] = 5

In [145]:
obj2

a    1
b    5
c    5
dtype: int64

In [146]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
    index=["Ohio", "Colorado", "Utah", "New York"],
    columns=["one", "two", "three", "four"])

In [147]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [148]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [149]:
data[["three","one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [150]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [151]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [152]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [153]:
data[data < 5] = 0

In [154]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [155]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [156]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [157]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [158]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [159]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [160]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [161]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [162]:
data.iloc[[1, 2],[3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [163]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [164]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [165]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [166]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [167]:
ser = pd.Series(np.arange(3.))

In [168]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [169]:
try:
    ser[-1]
except KeyError as e:
    print(f"oops...{e.with_traceback}")

oops...<built-in method with_traceback of KeyError object at 0x713ae0b84460>

In [170]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [171]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [172]:
ser2[-1]

/tmp/ipykernel_3771/811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [173]:
ser.iloc[-1]

2.0

In [174]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [175]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [176]:
data["one"] = 1

In [177]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [178]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
    index=["Ohio", "Colorado", "Utah", "New York"],
    columns=["one", "two", "three", "four"])

In [179]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [180]:
data["one"] = 1

In [181]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [182]:
data.loc["Ohio", ["two", "three", "four"]] = 0

In [183]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [184]:
data.loc[:,"one"]

Ohio        1
Colorado    1
Utah        1
New York    1
Name: one, dtype: int64

In [185]:
data.iloc[2] = 5

In [186]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [187]:
data.loc[data["four"] > 5] = 3

In [188]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [189]:
data.loc[data.three == 5, "three"] = 6

In [190]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [191]:
"""


 <<< 5.2.4 Arithmetic and Data Alignment >>>



"""

'\n\n\n <<< 5.2.4 Arithmetic and Data Alignment >>>\n\n\n\n'

In [192]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [193]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ["a", "c", "e", "f", "g"])

In [194]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [195]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [196]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [197]:
df1 = pd.DataFrame(np.arange(9.).reshape(3, 3), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])

In [198]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])

In [199]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [200]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [201]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [202]:
df1 = pd.DataFrame({"A":[1, 2]})

In [203]:
df1

   A
0  1
1  2

In [204]:
df2 = pd.DataFrame({"B":[3, 4]})

In [205]:
df1

   A
0  1
1  2

In [206]:
df2

   B
0  3
1  4

In [207]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [208]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns=list("abcd"))

In [209]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))

In [210]:
df2.loc[1, "b"] = np.nan

In [211]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [212]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [213]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [214]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [215]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [216]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [217]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [218]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [219]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [220]:
df1.radd(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [221]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [222]:
arr = np.arange(12.).reshape((3,4))

In [223]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [224]:
arr[0]

array([0., 1., 2., 3.])

In [225]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [226]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)), 
                    columns=list("bde"),
                    index=["Utah", "Ohio", "Texas", "Oregon"])

In [227]:
series = frame.iloc[0]

In [228]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [229]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [230]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [231]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [232]:
series2

b    0
e    1
f    2
dtype: int64

In [233]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [234]:
series3 = frame["d"]

In [235]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [236]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [237]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [238]:
"""


 <<< 5.2.5 Function Application and Mapping >>>



"""

'\n\n\n <<< 5.2.5 Function Application and Mapping >>>\n\n\n\n'

In [239]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [240]:
frame

               b         d         e
Utah    0.056424 -1.814083  1.551390
Ohio   -1.417902  0.179585  1.309233
Texas   2.504200 -1.228630  1.567070
Oregon  0.823204 -0.523491  0.792443

In [241]:
np.abs(frame)

               b         d         e
Utah    0.056424  1.814083  1.551390
Ohio    1.417902  0.179585  1.309233
Texas   2.504200  1.228630  1.567070
Oregon  0.823204  0.523491  0.792443

In [242]:
def f1(x):
    return x.max() - x.min()

In [243]:
frame.apply(f1)

b    3.922102
d    1.993668
e    0.774627
dtype: float64

In [244]:
frame.apply(f1, axis="columns")

Utah      3.365472
Ohio      2.727135
Texas     3.732830
Oregon    1.346695
dtype: float64

In [245]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [246]:
frame.apply(f2)

            b         d         e
min -1.417902 -1.814083  0.792443
max  2.504200  0.179585  1.567070

In [247]:
def my_format(x):
    return f"{x:.2f}"

In [248]:
frame.map(my_format)

            b      d     e
Utah     0.06  -1.81  1.55
Ohio    -1.42   0.18  1.31
Texas    2.50  -1.23  1.57
Oregon   0.82  -0.52  0.79

In [249]:
frame["e"].map(my_format)

Utah      1.55
Ohio      1.31
Texas     1.57
Oregon    0.79
Name: e, dtype: object

In [250]:
"""


 <<< 5.2.6 Sorting and Ranking >>>



"""

'\n\n\n <<< 5.2.6 Sorting and Ranking >>>\n\n\n\n'

In [251]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [252]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [253]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [254]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])

In [255]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [256]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [257]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [258]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [259]:
obj = pd.Series([4, 7, -3, 2])

In [260]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [261]:
obj=pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [262]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [263]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [264]:
frame = pd.DataFrame({"b":[4, 7, -3, 2], "a":[0, 1, 0, 1]})

In [265]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [266]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [267]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [268]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [269]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [270]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [271]:
frame = pd.DataFrame({"b":[4.3, 7, -3, 2], "a":[0, 1, 0, 1], "c":[-2, 5, 8, -2.5]})

In [272]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [273]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [274]:
"""

 <<< 5.2.7 Axis Indexes with Duplicate Labels >>>


"""

'\n\n <<< 5.2.7 Axis Indexes with Duplicate Labels >>>\n\n\n'

In [275]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [276]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [277]:
obj.index.is_unique

False

In [278]:
obj["a"]

a    0
a    1
dtype: int64

In [279]:
obj["c"]

4

In [280]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])

In [281]:
df

          0         1         2
a  1.062368 -1.162791 -0.481989
a -0.054543  1.367163 -0.772695
b  1.388752 -2.072145 -1.625251
b  0.196150  0.127398  0.156463
c -2.378658 -0.203817 -0.063538

In [282]:
df.loc["b"]

          0         1         2
b  1.388752 -2.072145 -1.625251
b  0.196150  0.127398  0.156463

In [283]:
df.loc["c"]

0   -2.378658
1   -0.203817
2   -0.063538
Name: c, dtype: float64

In [284]:
"""

 <<< 5.3 Summarizing and Computing Descriptive Statistics >>>


"""

'\n\n <<< 5.3 Summarizing and Computing Descriptive Statistics >>>\n\n\n'

In [285]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
              [np.nan, np.nan], [0.75, -1.3]],
            index=["a", "b", "c", "d"],
             columns=["one", "two"])

In [286]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [287]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [288]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [289]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [290]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [291]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [292]:
df.idxmax()

one    b
two    d
dtype: object

In [293]:
df.idxmin()

one    d
two    b
dtype: object

In [294]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [295]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [296]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [297]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [298]:
df.quantile()

one    1.4
two   -2.9
Name: 0.5, dtype: float64

In [299]:
df.var()

one    12.205833
two     5.120000
dtype: float64

In [300]:
df.std()

one    3.493685
two    2.262742
dtype: float64

In [301]:
df.skew()

one    1.664846
two         NaN
dtype: float64

In [302]:
df.kurt()

one   NaN
two   NaN
dtype: float64

In [303]:
df.cummin()

    one  two
a  1.40  NaN
b  1.40 -4.5
c   NaN  NaN
d  0.75 -4.5

In [304]:
df.pct_change(fill_method=None)

        one  two
a       NaN  NaN
b  4.071429  NaN
c       NaN  NaN
d       NaN  NaN

In [305]:
"""

 <<< 5.3.1 Correlation and Covariance >>>


"""

'\n\n <<< 5.3.1 Correlation and Covariance >>>\n\n\n'

In [306]:
price = pd.read_pickle("../examples/yahoo_price.pkl")

In [307]:
volume = pd.read_pickle("../examples/yahoo_volume.pkl")

In [308]:
returns = price.pct_change()

In [309]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [310]:
returns["MSFT"].corr(returns["IBM"])

0.49976361144151155

In [311]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703549e-05

In [312]:
returns["MSFT"].corr(returns["IBM"])

0.49976361144151155

In [313]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [314]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [315]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [316]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [317]:
"""

 <<< 5.3.2 Unique Values, Value Counts, and Memebrship >>>


"""

'\n\n <<< 5.3.2 Unique Values, Value Counts, and Memebrship >>>\n\n\n'

In [318]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [320]:
uniques= obj.unique()

In [321]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [323]:
uniques.sort()

In [325]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [326]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [327]:
pd.value_counts(obj.to_numpy(), sort=False)

/tmp/ipykernel_3771/164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [328]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [329]:
mask = obj.isin(["b", "c"])

In [330]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [331]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [332]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [333]:
unique_vals = pd.Series(["c", "b", "a"])

In [334]:
indices = pd.Index(unique_vals).get_indexer(to_match)

In [335]:
indices

array([0, 2, 1, 1, 0, 2])

In [336]:
data = pd.DataFrame({"Qu1":[1, 3, 4, 3, 4],
                    "Qu2":[2, 3, 1, 2, 3],
                    "Qu3":[1, 5, 2, 4, 4]})

In [337]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [339]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [340]:
result = data.apply(pd.value_counts).fillna(0)

/tmp/ipykernel_3771/2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [341]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [364]:
data = pd.DataFrame({"a":[1, 1, 1, 2, 2], "b":[0, 0, 1, 0, 0]})

In [366]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [369]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64

In [371]:
"""

 <<< 5.4 Conclusion >>>


"""

'\n\n <<< 5.4 Conclusion >>>\n\n\n'